<?php

// Задание 1
$x = 21;
$y = 8.6;

// Задание 2
echo 'x + y = ' . $x + $y . '<br>';
echo 'x - y = ' . $x - $y . '<br>';
echo 'x * y = ' . $x * $y . '<br>';
echo 'x / y = ' . $x / $y . '<br>';

// Задание 3
echo "Кубический корень из $x равен " . $x ** (1 / 3) . '<br>';

// Задание 4
$x++;
echo 'x = ' . $x . '<br>';

// Задание 5
$x++;
$x++;
echo 'x = ' . $x . '<br>';

// Задание 6
$x = 21;
$y = 8.6;

// Задание 7
$res = ($x + $y * $x - $y + 15 / $x);
echo "$res<br>";

// Задание 8
$str_1 = 'Я прохожу курс';
$str_2 = 'по PHP';

// Задание 9
$res_str = $str_1 . ' ' . $str_2;

// Задание 10
echo "$res_str<br>";

// Задание 11
$str_esc = "\\\\\\";
echo "$str_esc<br>";