<?php
// Задание 7
$settings = parse_ini_file('settings.ini', true);

if (isset($_GET['lang'])) {
  $lang = $_GET['lang'];
} else {
  $ru_pos = strpos($_SERVER['HTTP_ACCEPT_LANGUAGE'], 'ru');
  $en_pos = strpos($_SERVER['HTTP_ACCEPT_LANGUAGE'], 'en');

  $lang = $ru_pos < $en_pos ? 'ru' : 'en';
}

$title = parse_ini_file($lang . '.ini');

?>

<!-- Задание 5 -->
<!DOCTYPE html>
<html lang="ru">

<head>
  <meta charset="UTF-8">
  <meta http-equiv="X-UA-Compatible" content="IE=edge">
  <meta name="viewport" content="width=device-width, initial-scale=1.0">
  <title><?= $title['TITLE']; ?></title>

  <style>
  p {
    color: <?=$settings['Text']['color'] ?? '#000000';
    ?>;
    font-size: <?=$settings['Text']['size'] ?? '18px';
    ?>;
  }
  </style>
</head>

<body>
  <!-- Задание 6. -->
  <p>Далеко-далеко за словесными горами в стране гласных, и согласных живут рыбные тексты. Скатился снова знаках дороге
    то наш ее, по всей свой предложения путь если продолжил сих собрал, переписывается взгляд обеспечивает города
    жаренные.
    Запятых языкового бросил возвращайся строчка ее дал буквоград, родного которой прямо? По всей своих осталось
    повстречался букв выйти снова! Пор вопроса своего города реторический мир точках строчка деревни от всех собрал там.
    Предложения дороге по всей однажды заглавных предупредила большой букв точках назад жаренные подзаголовок, рыбного
    взобравшись силуэт своего оксмокс реторический живет проектах инициал напоивший безопасную деревни несколько моей.
    Знаках толку свою гор?
    Инициал рыбного рыбными она дороге лучше имеет своих вскоре меня великий встретил переулка страну снова знаках
    предупреждал повстречался алфавит сих, выйти переписали ведущими свой большой. Заглавных вопроса города инициал
    текстами.
    Букв большого свою всемогущая они по всей? Ему журчит на берегу, океана выйти правилами он свой одна проектах
    предупредила грамматики пор толку бросил грустный переулка. От всех подзаголовок своих журчит толку города
    обеспечивает.</p>
  <p>
    Далеко-далеко за словесными горами в стране гласных и согласных живут рыбные тексты. Запятых, осталось точках
    алфавит предупредила меня города бросил решила журчит, текстов его строчка все! Строчка семь реторический своих
    маленький взобравшись!
    Необходимыми предупреждал свою ipsum прямо жаренные мир переписывается решила которой встретил агентство имеет о,
    маленький, себя буквоград журчит, там деревни. Буквенных даже своего возвращайся собрал вскоре? Мир наш назад
    великий.
    Власти оксмокс прямо запятой даже реторический моей. Дороге оксмокс даль парадигматическая снова все пор переписали
    алфавит одна маленький курсивных. Однажды текст свое пояс пор семантика дорогу повстречался текстами снова его.
    Приставка океана инициал рыбного деревни алфавит однажды выйти грамматики коварных агентство текста! Ведущими всеми
    прямо переписали ipsum коварный путь вдали жаренные. Маленький строчка великий безорфографичный страну это силуэт
    диких страна!
    Грамматики его, строчка силуэт пояс оксмокс всеми курсивных инициал большого жизни единственное семантика подпоясал
    то злых использовало своих эта собрал правилами но пунктуация предупредила пустился реторический первую о. Страна,
    однажды!
    Меня решила рукописи пор родного себя речью вскоре буквоград приставка. Он, снова своего, имени свою предупредила
    всеми грустный пунктуация напоивший деревни раз вершину ее ipsum предупреждал, своих рот курсивных рыбными.
    Подзаголовок сбить на берегу по всей, рот безопасную текста, заманивший свое реторический рыбного маленький это наш
    страна, семь снова дал страну запятой сих за жаренные парадигматическая буквенных скатился! Языком маленькая путь
    залетают!
  </p>
</body>

</html>